<?php

return [
    'db-conncet' => [
        'driver'    => 'mysql',
        'host'      => 'localhost',
        'database'  => 'tz_1',
        'username'  => 'root',
        'password'  => '123',
        'charset'   => 'utf8',
        'collation' => 'utf8_unicode_ci',
        'prefix'    => '',
    ],

    'seeders' => [
        'categories' => [
            ['name' => 'Побутова техніка'],
            ['name' => 'Розважальна техніка'],
            ['name' => 'Електроінструменти'],
            ['name' => 'Освітлювальна техніка'],
        ],

        'products' => [
            ['date' => '2023-05-02', 'price' => 199.99, 'name' => 'Електричний чайник'],
            ['date' => '2023-05-03', 'price' => 149.99, 'name' => 'Мікрохвильовка'],
            ['date' => '2023-05-04', 'price' => 599.99, 'name' => 'Кофемашина'],
            ['date' => '2023-05-07', 'price' => 129.99, 'name' => 'Блендер'],
            ['date' => '2023-05-01', 'price' => 999.99, 'name' => 'Телевізор'],

            ['date' => '2023-05-06', 'price' => 499.99, 'name' => 'Планшет'],
            ['date' => '2023-05-08', 'price' => 799.99, 'name' => 'Ноутбук'],
            ['date' => '2023-05-10', 'price' => 349.99, 'name' => 'Електронна книга'],
            ['date' => '2023-05-11', 'price' => 179.99, 'name' => 'Музичний програвач'],
            ['date' => '2023-05-12', 'price' => 699.99, 'name' => 'Смартфон'],

            ['date' => '2023-05-05', 'price' => 299.99, 'name' => 'Лампа'],
            ['date' => '2023-05-09', 'price' => 249.99, 'name' => 'Люстра'],
        ],
    ]
];
